[
{
    "id": 1,
    "nome": "Inventário e controle de ativos da empresa",
    "descricao": "Gerenciar ativamente (inventariar, rastrear e corrigir) todos os ativos da empresa (dispositivos de usuário final, incluindo portáteis e móveis; dispositivos de rede; dispositivos não informáticos / IoT - Internet das Coisas; e servidores) conectados à infraestrutura fisicamente, virtualmente, remotamente, e aqueles em ambientes de nuvem, para saber com precisão a totalidade de ativos que precisam ser monitorados e protegidos dentro da empresa. Isso também apoiará a identificação de ativos não autorizados e não gerenciados para remover ou corrigir.",
    "subcontroles": [
        {
            "id": "1.1",
            "nome": "Estabelecer e manter um inventário detalhado de ativos da empresa",
            "descricao": "Estabelecer e manter um inventário preciso, detalhado e atualizado de todos os ativos da empresa com potencial para armazenar ou processar dados, incluindo: dispositivos de usuário final (incluindo portáteis e móveis), dispositivos de rede, não informática / IoT dispositivos e servidores. Certificar-se de que o inventário registre o endereço de rede (se estático), endereço de hardware, nome da máquina, proprietário do ativo corporativo, departamento para cada ativo e se o ativo foi aprovado para se conectar à rede. Para dispositivos móveis de usuário final, as ferramentas do tipo MDM podem oferecer suporte a esse processo, quando apropriado. Este inventário inclui ativos conectados à infraestrutura fisicamente, virtualmente, remotamente e aqueles dentro de ambientes de nuvem. Além disso, inclui ativos que são regularmente conectados à infraestrutura de rede da empresa, mesmo que não estejam sob o controle da empresa. Revisar e atualizar o inventário de todos os ativos da empresa semestralmente ou com maior frequência."
        },
        {
            "id": "1.2",
            "nome": "Adereçar ativos não autorizados",
            "descricao": "Certificar-se de que existe um processo para lidar com ativos não autorizados semanalmente. A empresa pode escolher remover o ativo da rede, negar que o ativo se conecte remotamente à rede ou colocar o ativo em quarentena."
        },
        {
            "id": "1.3",
            "nome": "Utilizar uma ferramenta de descoberta ativa",
            "descricao": "Utilizar uma ferramenta de descoberta ativa para identificar ativos conectados à rede da empresa. Configurar a ferramenta de descoberta ativa para executar diariamente ou com maior frequência."
        },
        {
            "id": "1.4",
            "nome": "Usar o registro do protocolo de configuração dinâmica de hosts (DHCP) para atualizar o inventário de ativos corporativos",
            "descricao": "Usar o log de DHCP em todos os servidores DHCP ou ferramentas de gerenciamento de endereço de protocolo da Internet (IP) para atualizar o inventário de ativos da empresa. Revisar e usar logs para atualizar o inventário de ativos da empresa semanalmente ou com maior frequência."
        },
        {
            "id": "1.5",
            "nome": "Usar uma ferramenta de descoberta de ativos passivos",
            "descricao": "Usar uma ferramenta de descoberta passiva para identificar ativos conectados à rede da empresa. Revisar e Usar varreduras para atualizar o inventário de ativos da empresa pelo menos semanalmente ou com maior frequência."
        }
    ]
},
{
    "id": 2,
    "nome": "Inventário e controle de ativos de software",
    "descricao": "Gerenciar ativamente (inventarie, rastreie e corrija) todos os softwares (sistemas operacionais e aplicações) na rede para que apenas softwares autorizados sejam instalados e possam ser executados, e que softwares não autorizados e não gerenciados sejam encontrados e impedidos de instalação ou execução.",
    "subcontroles": [
        {
            "id": "2.1",
            "nome": "Estabelecer e manter um inventário de software",
            "descricao": "Estabelecer e manter um inventário detalhado de todos os softwares licenciados instalados em ativos corporativos. O inventário de software deve documentar o título, o editor, a data inicial de instalação / uso e a finalidade comercial de cada entrada; quando apropriado, inclua o Uniform Resource Locator (URL), app store(s), versão(ões), mecanismo de implantação e data de desativação. Revisar e atualizar o inventário de software semestralmente ou com maior frequência."
        },
        {
            "id": "2.2",
            "nome": "Certificar-se de que o software autorizado seja atualmente suportado",
            "descricao": "Certificar-se de que apenas o software com suporte atualmente seja designado como autorizado no inventário de software para ativos corporativos. Se o software não for compatível, mas necessário para o cumprimento da missão da empresa, documentar uma exceção detalhando os controles de mitigação e a aceitação do risco residual. Para qualquer software sem suporte sem uma documentação de exceção, designar como não autorizado. Revisar a lista de software para verificar o suporte de software pelo menos uma vez por mês ou com maior frequência."
        },
        {
            "id": "2.3",
            "nome": "Adereçar a software não autorizado",
            "descricao": "Certificar-se de que o software não autorizado seja removido do uso em ativos corporativos ou receber uma exceção documentada. Revisar mensalmente ou com maior frequência."
        },
        {
            "id": "2.4",
            "nome": "Utilize ferramentas automatizadas de inventário de software",
            "descricao": "Utilizar ferramentas de inventário de software, quando possível, em toda a empresa para automatizar a descoberta e documentação do software instalado."
        },
        {
            "id": "2.5",
            "nome": "Lista de permissões para software autorizado",
            "descricao": "Usar controles técnicos, como a lista de permissões de aplicativos, para garantir que apenas software autorizado possa executar ou ser acessado. Reavaliar semestralmente ou com maior frequência."
        },
        {
            "id": "2.6",
            "nome": "Bibliotecas autorizadas de lista de permissões",
            "descricao": "Usar controles técnicos para garantir que apenas bibliotecas de software autorizadas, como arquivos .dll, .ocx, .so, etc. específicos, tenham permissão para carregar em um processo do sistema. Bloquear o carregamento de bibliotecas não autorizadas em um processo do sistema. Reavaliar semestralmente ou com maior frequência."
        },
        {
            "id": "2.7",
            "nome": "Scripts autorizados da lista de permissões",
            "descricao": "Usar controles técnicos, como assinaturas digitais e controle de versão, para garantir que apenas scripts autorizados, como arquivos .ps1, .py, etc. específicos, tenham permissão para executar. Bloquear a execução de scripts não autorizados. Reavaliar semestralmente ou com maior frequência."
        }
    ]
},
{
    "id": 3,
    "nome": "Proteção de dados",
    "descricao": "Desenvolver processos e controles técnicos para identificar, classificar, manusear, reter e descartar dados com segurança.",
    "subcontroles": [
        {
            "id": "3.1",
            "nome": "Estabelecer e manter um processo de gerenciamento de dados",
            "descricao": "Estabelecer e manter um processo de gerenciamento de dados. No processo, tratar da sensibilidade dos dados, do proprietário dos dados, do manuseio dos dados, dos limites de retenção de dados e dos requisitos de descarte, com base em padrões de sensibilidade e retenção para a empresa. Revisar e atualizar a documentação anualmente ou quando ocorrerem mudanças significativas na empresa que possam afetar esta proteção."
        },
        {
            "id": "3.2",
            "nome": "Estabelecer e manter um inventário de dados",
            "descricao": "Estabelecer e manter um inventário de dados, com base no processo de gerenciamento de dados da empresa. Dados confidenciais do inventário, no mínimo. Revisar e atualizar o inventário anualmente, no mínimo, com prioridade nos dados confidenciais."
        },
        {
            "id": "3.3",
            "nome": "Configurar listas de controle de acesso a dados",
            "descricao": "Configurar listas de controle de acesso a dados com base na necessidade de um usuário saber. Aplicar listas de controle de acesso a dados, também conhecidas como permissões de acesso, a sistemas de arquivos, bancos de dados e aplicativos locais e remotos."
        },
        {
            "id": "3.4",
            "nome": "Aplicar retenção de dados",
            "descricao": "Reter os dados de acordo com o processo de gerenciamento de dados da empresa. A retenção de dados deve incluir cronogramas mínimo e máximo."
        },
        {
            "id": "3.5",
            "nome": "Descartar de dados com segurança",
            "descricao": "Eliminar os dados com segurança conforme descrito no processo de gerenciamento de dados da empresa. Certificar-se de que o processo e o método de descarte sejam proporcionais à sensibilidade dos dados."
        },
        {
            "id": "3.6",
            "nome": "Criptografar dados em dispositivos de usuário final",
            "descricao": "Criptografar os dados em dispositivos do usuário final contendo dados confidenciais. Implementações de exemplo podem incluir: Windows BitLocker®, Apple FileVault®, Linux® dm-crypt."
        },
        {
            "id": "3.7",
            "nome": "Estabelecer e manter um esquema de classificação de dados",
            "descricao": "Estabelecer e manter um esquema geral de classificação de dados para a empresa. As empresas podem usar rótulos, como “Sensível”, “Confidencial” e “Público”, e classificar seus dados de acordo com esses rótulos. Revisar e atualizar o esquema de classificação anualmente ou quando ocorrerem mudanças significativas na empresa que possam impactar esta proteção."
        },
        {
            "id": "3.8",
            "nome": "Fluxos de dados de documentos",
            "descricao": "Fluxos de dados do documento. A documentação do fluxo de dados inclui fluxos de dados do provedor de serviços e deve ser baseada no processo de gerenciamento de dados da empresa. Revisar e atualizar a documentação anualmente ou quando ocorrerem mudanças significativas na empresa que possam afetar esta proteção."
        },
        {
            "id": "3.9",
            "nome": "Criptografar dados em mídia removível",
            "descricao": "Criptografar os dados em mídia removível."
        },
        {
            "id": "3.10",
            "nome": "Criptografar dados confidenciais em trânsito",
            "descricao": "Criptografar dados confidenciais em trânsito. Implementações de exemplo podem incluir: Transport Layer Security (TLS) e Open Secure Shell (OpenSSH)."
        },
        {
            "id": "3.11",
            "nome": "Criptografar dados confidenciais em repouso",
            "descricao": "Criptografar dados confidenciais em repouso em servidores, aplicativos e bancos de dados que contenham dados confidenciais. A criptografia da camada de armazenamento, também conhecida como criptografia do lado do servidor, atende ao requisito mínimo desta proteção. Métodos de criptografia adicionais podem incluir criptografia de camada de aplicativo, também conhecida como criptografia do lado do cliente, em que o acesso ao (s) dispositivo (s) de armazenamento de dados não permite o acesso aos dados de texto simples."
        },
        {
            "id": "3.12",
            "nome": "Segmentar processamento e armazenamento de dados com base na sensibilidade",
            "descricao": "Segmentar o processamento e armazenamento de dados com base na sensibilidade dos dados. Não processar dados confidenciais em ativos corporativos destinados a dados de menor sensibilidade."
        },
        {
            "id": "3.13",
            "nome": "Implantar uma solução de prevenção contra perda de dados",
            "descricao": "Implementar uma ferramenta automatizada, como uma ferramenta de prevenção de perda de dados (DLP) baseada em host, para identificar todos os dados confidenciais armazenados, processados ​​ou transmitidos por meio de ativos da empresa, incluindo aqueles situados no local ou em um provedor de serviços remoto, e atualizar o inventário de dados confidenciais da empresa."
        },
        {
            "id": "3.14",
            "nome": "Registrar acesso a dados confidenciais",
            "descricao": "Registrar o acesso a dados confidenciais, incluindo modificação e descarte."
        }
    ]
},
{
    "id": 4,
    "nome": "Configuração segura de ativos corporativos e software",
    "descricao": "Estabelecer e manter a configuração segura de ativos corporativos e software.",
    "subcontroles": [
        {
            "id": "4.1",
            "nome": "Estabelecer e manter um processo de configuração seguro",
            "descricao": "Estabelecer e manter um processo de configuração seguro para ativos corporativos (dispositivos de usuário final, incluindo dispositivos portáteis e móveis, não computacionais / IoT e servidores) e software (sistemas operacionais e aplicativos). Revisar e atualizar a documentação anualmente ou quando ocorrerem mudanças significativas na empresa que possam afetar esta proteção."
        },
        {
            "id": "4.2",
            "nome": "Estabelecer e manter um processo de configuração seguro para infraestrutura de rede",
            "descricao": "Estabelecer e manter um processo de configuração seguro para dispositivos de rede. Revisar e atualizar a documentação anualmente ou quando ocorrerem mudanças significativas na empresa que possam afetar esta proteção."
        },
        {
            "id": "4.3",
            "nome": "Configurar o bloqueio automático de sessão em ativos corporativos",
            "descricao": "Configurar o bloqueio automático de sessão em ativos corporativos após um período definido de inatividade. Para sistemas operacionais de uso geral, o período não deve exceder 15 minutos. Para dispositivos móveis de usuário final, o período não deve exceder 2 minutos."
        },
        {
            "id": "4.4",
            "nome": "Implementar e gerenciar um firewall em servidores",
            "descricao": "Implementar e gerenciar um firewall nos servidores, onde houver suporte. Implementações de exemplo incluem um firewall virtual, firewall do sistema operacional ou um agente de firewall de terceiros."
        },
        {
            "id": "4.5",
            "nome": "Implementar e gerenciar um firewall em dispositivos de usuário final",
            "descricao": "Implementar e gerenciar um firewall baseado em host ou uma ferramenta de filtragem de porta em dispositivos de usuário final, com uma regra de negação padrão que elimina todo o tráfego, exceto os serviços e portas que são explicitamente permitidos."
        },
        {
            "id": "4.6",
            "nome": "Gerenciar com segurança ativos corporativos e software",
            "descricao": "Gerenciar com segurança ativos e software corporativos. Implementações de exemplo incluem gerenciamento de configuração por meio de infraestrutura controlada por versão como código e acesso a interfaces administrativas em protocolos de rede seguros, como Secure Shell (SSH) e Hypertext Transfer Protocol Secure (HTTPS). Não usar protocolos de gerenciamento inseguros, como Telnet (Teletype Network) e HTTP, a menos que seja operacionalmente essencial."
        },
        {
            "id": "4.7",
            "nome": "Gerenciar contas padrão em ativos corporativos e software",
            "descricao": "Gerenciar contas padrão em ativos e software corporativos, como root, administrador e outras contas de fornecedores pré-configuradas. Implementações de exemplo podem incluir: desativar contas padrão ou torná-las inutilizáveis."
        },
        {
            "id": "4.8",
            "nome": "Desinstalar ou desativar serviços desnecessários em ativos e software da empresa",
            "descricao": "Desinstalar ou desativar serviços desnecessários em ativos e software corporativos, como um serviço de compartilhamento de arquivos não utilizado, módulo de aplicativo da web ou função de serviço."
        },
        {
            "id": "4.9",
            "nome": "Configurar servidores DNS confiáveis em ativos corporativos",
            "descricao": "Configurar servidores DNS confiáveis ​​em ativos corporativos. As implementações de exemplo incluem: configuração de ativos para usar servidores DNS controlados pela empresa e/ou servidores DNS confiáveis ​​acessíveis externamente."
        },
        {
            "id": "4.10",
            "nome": "Aplicar o bloqueio automático de dispositivos em dispositivos portáteis de usuário final",
            "descricao": "Impor o bloqueio automático de dispositivo seguindo um limite predeterminado de tentativas de autenticação local com falha em dispositivos portáteis de usuário final, quando compatível. Para laptops, não permitir mais de 20 tentativas de autenticação com falha; para tablets e smartphones, não mais do que 10 tentativas de autenticação com falha. Implementações de exemplo incluem Microsoft® InTune Device Lock e Apple® Configuration Profile maxFailedAttempts."
        },
        {
            "id": "4.11",
            "nome": "Aplicar capacidade de apagamento remoto em dispositivos portáteis de usuário final",
            "descricao": "Limpar remotamente os dados corporativos de dispositivos portáteis de usuário final de propriedade da empresa quando for considerado apropriado, como dispositivos perdidos ou roubados, ou quando um indivíduo não oferecer mais suporte à empresa."
        },
        {
            "id": "4.12",
            "nome": "Espaços de trabalho corporativos separados em dispositivos móveis de usuário final",
            "descricao": "Certificar-se de que espaços de trabalho corporativos separados sejam usados ​​em dispositivos móveis de usuário final, onde houver suporte. Implementações de exemplo incluem o uso de um Apple® Configuration Profile ou Android ™ Work Profile para separar aplicativos e dados corporativos de aplicativos e dados pessoais."
        }
    ]
},
{
    "id": 5,
    "nome": "Gestão de Contas",
    "descricao": "Usar processos e ferramentas para atribuir e gerenciar autorização para credenciais para contas de usuário, incluindo contas de administrador, bem como contas de serviço, para ativos corporativos e software.",
    "subcontroles": [
        {
            "id": "5.1",
            "nome": "Estabelecer e manter um inventário de contas",
            "descricao": "Estabelecer e manter um inventário de todas as contas gerenciadas na empresa. O inventário deve incluir contas de usuário e administrador. O inventário deve conter, no mínimo, o nome da pessoa, nome de usuário, datas de início / término e departamento. Valide se todas as contas ativas estão autorizadas, em uma programação recorrente no mínimo trimestralmente ou com maior frequência."
        },
        {
            "id": "5.2",
            "nome": "Usar senhas exclusivas",
            "descricao": "Usar senhas exclusivas para todos os ativos da empresa. A implementação de práticas recomendadas inclui, no mínimo, uma senha de 8 caracteres para contas que usam MFA e uma senha de 14 caracteres para contas que não usam MFA."
        },
        {
            "id": "5.3",
            "nome": "Desativar contas inativas",
            "descricao": "Excluir ou desativar quaisquer contas inativas após um período de 45 dias de inatividade, quando houver suporte."
        },
        {
            "id": "5.4",
            "nome": "Restringir privilégios de administrador a contas de administrador dedicadas",
            "descricao": "Restringir os privilégios de administrador a contas de administrador dedicadas em ativos corporativos. Realizar atividades gerais de computação, como navegação na Internet, e-mail e uso do pacote de produtividade, a partir da conta primária não privilegiada do usuário."
        },
        {
            "id": "5.5",
            "nome": "Estabelecer e manter um inventário de contas de serviço",
            "descricao": "Estabelecer e manter um inventário de contas de serviço. O inventário, no mínimo, deve conter o proprietário do departamento, a data da revisão e o propósito. Realizar análises de contas de serviço para validar se todas as contas ativas estão autorizadas, em uma programação recorrente, no mínimo trimestralmente ou com maior frequência."
        },
        {
            "id": "5.6",
            "nome": "Centralizar o gerenciamento de contas",
            "descricao": "Centralizar o gerenciamento de contas por meio de um diretório ou serviço de identidade."
        }
    ]
},
{
    "id": 6,
    "nome": "Gerenciamento de controle de acesso",
    "descricao": "Usar processos e ferramentas para criar, atribuir, gerenciar e revogar credenciais de acesso e privilégios para contas de usuário, administrador e serviço para ativos e software corporativos.",
    "subcontroles": [
        {
            "id": "6.1",
            "nome": "Estabelecer um Processo de Concessão de Acesso",
            "descricao": "Estabelecer e seguir um processo, de preferência automatizado, para conceder acesso aos ativos da empresa mediante nova contratação, concessão de direitos ou mudança de função de um usuário."
        },
        {
            "id": "6.2",
            "nome": "Estabelecer um Processo de Revogação de Acesso",
            "descricao": "Estabelecer e seguir um processo, de preferência automatizado, para revogar o acesso aos ativos da empresa, por meio da desativação de contas imediatamente após o encerramento, revogação de direitos ou mudança de função de um usuário. Desativar contas, em vez de excluí-las, pode ser necessário para preservar as trilhas de auditoria."
        },
        {
            "id": "6.3",
            "nome": "Exigir MFA para aplicativos expostos externamente",
            "descricao": "Exigir que todos os aplicativos expostos externamente, corporativos ou de terceiros, apliquem o MFA quando houver suporte. Aplicar o MFA por meio de um serviço de diretório ou provedor de SSO é uma implementação satisfatória desta proteção."
        },
        {
            "id": "6.4",
            "nome": "Exigir MFA para acesso remoto à rede",
            "descricao": "Exigir MFA para acesso remoto à rede."
        },
        {
            "id": "6.5",
            "nome": "Exigir MFA para acesso administrativo",
            "descricao": "Exigir MFA para todas as contas de acesso administrativo, onde houver suporte, em todos os ativos da empresa, sejam gerenciados no local ou por meio de um provedor terceirizado."
        },
        {
            "id": "6.6",
            "nome": "Estabelecer e manter um inventário de sistemas de autenticação e autorização",
            "descricao": "Estabelecer e manter um inventário dos sistemas de autenticação e autorização da empresa, incluindo aqueles hospedados no local ou em um provedor de serviços remoto. Revisar e atualizar o inventário, no mínimo, anualmente ou com maior frequência."
        },
        {
            "id": "6.7",
            "nome": "Centralizar o controle de acesso",
            "descricao": "Centralizar o controle de acesso para todos os ativos da empresa por meio de um serviço de diretório ou provedor de SSO, onde houver suporte."
        },
        {
            "id": "6.8",
            "nome": "Definir e manter o controle de acesso baseado em funções",
            "descricao": "Definir e manter o controle de acesso baseado em funções, determinando e documentando os direitos de acesso necessários para cada função dentro da empresa para cumprir com sucesso suas funções atribuídas. Realizar análises de controle de acesso de ativos corporativos para validar se todos os privilégios estão autorizados, em uma programação recorrente, no mínimo anualmente ou com maior frequência."
        }
    ]
},
{
    "id": 7,
    "nome": "Gerenciamento Contínuo de Vulnerabilidade",
    "descricao": "Desenvolver um plano para avaliar e rastrear vulnerabilidades continuamente em todos os ativos corporativos dentro da infraestrutura da empresa, a fim de remediar e minimizar a janela de oportunidade para os invasores. Monitorar fontes da indústria pública e privada para novas informações sobre ameaças e vulnerabilidades.",
    "subcontroles": [
        {
            "id": "7.1",
            "nome": "Estabelecer e manter um processo de gerenciamento de vulnerabilidade",
            "descricao": "Estabelecer e manter um processo de gerenciamento de vulnerabilidade documentado para ativos corporativos. Revisar e atualizar a documentação anualmente ou quando ocorrerem mudanças significativas na empresa que possam afetar esta proteção."
        },
        {
            "id": "7.2",
            "nome": "Estabelecer e manter um processo de remediação",
            "descricao": "Estabelecer e manter uma estratégia de remediação baseada em risco documentada em um processo de remediação, com revisões mensais ou mais frequentes."
        },
        {
            "id": "7.3",
            "nome": "Executar gerenciamento automatizado de patches do sistema operacional",
            "descricao": "Executar atualizações do sistema operacional em ativos corporativos por meio do gerenciamento automatizado de patches mensalmente ou com maior frequência."
        },
        {
            "id": "7.4",
            "nome": "Executar gerenciamento automatizado de patches de aplicativos",
            "descricao": "Realizar atualizações de aplicativos em ativos corporativos por meio do gerenciamento automatizado de patches mensalmente ou com maior frequência."
        },
        {
            "id": "7.5",
            "nome": "Realizar varreduras automatizadas de vulnerabilidade de ativos internos da empresa",
            "descricao": "Realizar varreduras automatizadas de vulnerabilidade de ativos corporativos internos trimestralmente ou com maior frequência. Realizar varreduras autenticadas e não autenticadas, usando uma ferramenta de varredura de vulnerabilidade compatível com SCAP."
        },
        {
            "id": "7.6",
            "nome": "Realizar varreduras automatizadas de vulnerabilidade de ativos corporativos expostos externamente",
            "descricao": "Executar varreduras de vulnerabilidade automatizadas de ativos corporativos expostos externamente usando uma ferramenta de varredura de vulnerabilidade compatível com SCAP. Executar varreduras mensalmente ou com maior frequência."
        },
        {
            "id": "7.7",
            "nome": "Corrigir vulnerabilidades detectadas",
            "descricao": "Corrigir as vulnerabilidades detectadas no software por meio de processos e ferramentas em uma base mensal, ou mais frequente, com base no processo de correção."
        }
    ]
},
{
    "id": 8,
    "nome": "Gerenciamento de registro de auditoria",
    "descricao": "Coletar, alertar, analisar e reter logs de auditoria de eventos que podem ajudar a detectar, compreender ou recuperar-se de um ataque.",
    "subcontroles": [
        {
            "id": "8.1",
            "nome": "Estabelecer e manter um processo de gerenciamento de registro de auditoria",
            "descricao": "Estabelecer e manter um processo de gerenciamento de registro de auditoria que defina os requisitos de registro da empresa. No mínimo, tratar da coleta, revisão e retenção de logs de auditoria para ativos corporativos. Revisar e atualizar a documentação anualmente ou quando ocorrerem mudanças significativas na empresa que possam afetar esta proteção."
        },
        {
            "id": "8.2",
            "nome": "Coletar registros de auditoria",
            "descricao": "Coletar logs de auditoria. Certificar-se de que o registro, de acordo com o processo de gerenciamento de registro de auditoria da empresa, foi habilitado em todos os ativos da empresa."
        },
        {
            "id": "8.3",
            "nome": "Garantir armazenamento adequado de registros de auditoria",
            "descricao": "Certificar-se de que os destinos de registro mantenham armazenamento adequado para cumprir o processo de gerenciamento de registro de auditoria da empresa."
        },
        {
            "id": "8.4",
            "nome": "Padronizar a sincronização de tempo",
            "descricao": "Padronizar a sincronização de tempo. Configurar pelo menos duas fontes de tempo sincronizadas em ativos corporativos, onde houver suporte."
        },
        {
            "id": "8.5",
            "nome": "Coletar registros de auditoria detalhados",
            "descricao": "Configurar o registro de auditoria detalhado para ativos corporativos contendo dados confidenciais. Incluir a origem do evento, data, nome de usuário, carimbo de data / hora, endereços de origem, endereços de destino e outros elementos úteis que podem ajudar em uma investigação forense."
        },
        {
            "id": "8.6",
            "nome": "Coletar registros de auditoria de consulta DNS",
            "descricao": "Coletar logs de auditoria de consulta de DNS em ativos corporativos, quando apropriado e com suporte."
        },
        {
            "id": "8.7",
            "nome": "Coletar registros de auditoria de solicitação de URL",
            "descricao": "Coletar logs de auditoria de solicitação de URL em ativos corporativos, quando apropriado e com suporte."
        },
        {
            "id": "8.8",
            "nome": "Coletar registros de auditoria de linha de comando",
            "descricao": "Coletar logs de auditoria de linha de comando. Implementações de exemplo incluem a coleta de logs de auditoria do PowerShell®, BASH ™ e terminais administrativos remotos."
        },
        {
            "id": "8.9",
            "nome": "Centralizar registros de auditoria",
            "descricao": "Centralizar, na medida do possível, a coleta e retenção de logs de auditoria nos ativos da empresa."
        },
        {
            "id": "8.10",
            "nome": "Reter registros de auditoria",
            "descricao": "Reter logs de auditoria em ativos corporativos por no mínimo 90 dias."
        },
        {
            "id": "8.11",
            "nome": "Conduzir revisões de registro de auditoria",
            "descricao": "Realizar análises de logs de auditoria para detectar anomalias ou eventos anormais que possam indicar uma ameaça potencial. Faça avaliações semanais ou mais frequentes."
        },
        {
            "id": "8.12",
            "nome": "Coletar registros do provedor de serviços",
            "descricao": "Coletar logs do provedor de serviços, onde houver suporte. Implementações de exemplo incluem coleta de eventos de autenticação e autorização, criação de dados e eventos de descarte e eventos de gerenciamento de usuário."
        }
    ]
}
]




